public class test {
    public static void main(String[] args) {
        String nu ="一种茶叶摇青机，包括机架与滚筒，滚筒可定轴转动装配于机架；所述滚筒为用于茶叶摇青的圆筒状滚筒，滚筒定轴转动的旋转轴线位于水平面内；其特征在于：还包括移料机构，移料机构邻近所述滚筒圆筒状结构两个端部中的其中一个设置；所述移料机构包括横移座以及移料斗，横移座可沿滚筒旋转轴线移动地装配于所述机架，移料斗为一面敞口的料斗结构，移料斗可定轴转动地装配于横移座，横移座可与滚筒相近相离移动装配，移料斗装配于横移座朝向滚筒所在位置的一侧；该滚筒朝向移料机构所在位置的一端端面开设有移料通孔，移料通孔贯穿滚筒端面设置；所述横移座与滚筒相近相离移动驱动所述移料斗由所述移料通孔进入或者离开滚筒；该移料斗定轴转动的旋转轴线与滚筒定轴转动的旋转轴线为同一直线，当移料斗位于滚筒内时，移料斗与滚筒同步转动。 2.根据权利要求1所述的一种茶叶摇青机，其特征在于：所述滚筒背离所述移料机构所在位置的一端端面封闭设置；当所述移料斗位于滚筒内时，移料斗宽度方向上的两侧均邻近滚筒内壁设置。 3.根据权利要求1所述的一种茶叶摇青机，其特征在于：所述滚筒由电机驱动转动；所述横移座由伺服电机驱动移动；所述移料斗由伺服电机驱动转动。";

    }
}
